backend/controllers/DetailtransController.php

INSERT INTO `detail_trans` (`id_imei`, `name`, `address`, `phone`, `email`, `path_src`, `path_web`, `status`, `stat_email1`, `stat_email2`, `created_at`) VALUES (123, 'Aditiya Kelana', 'Jl. H. Nawi Raya No.14 (Wisesa Motorsport)', '081219656530', 'aditiya@oppomobile.co.id', '123', '123', 1, 0, 0, NULL)
---
    public function actionCreate()
    {
        $model = new DetailTrans();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `detail_trans` WHERE `id_trans`='3'
UPDATE `detail_trans` SET `id_imei`=123, `status`=2, `stat_email1`=0, `stat_email2`=0 WHERE `id_trans`=1
---
    public function actionApprove($id)
    {
        $model = $this->findModel($id);

        $searchModel = new DetailTransSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $getforsend = (new \yii\db\Query())
                        ->select('*')
                        ->from('detail_trans')
                        ->where(['id_trans' => $id])
                        ->all();
        $nama = $getforsend[0]['name'];
        $mail = $getforsend[0]['email'];


            //Update status email
            $connection = Yii::$app->db;
            $connection->createCommand()->update('detail_trans', ['status' => 2], 'id_trans ='.$id)->execute();