backend/controllers/SiteController.php

    public function actionIndex()
    {
		$imeicount = Imei::find()
			->count();
		$imeiwarehouse = Imei::find()
			->where(['warehouse' => 1])
			->count();
		$imeisold = Imei::find()
			->where(['sold' => 1])
			->count();
---
SELECT COUNT(*) FROM `imei`
SELECT COUNT(*) FROM `imei` WHERE `warehouse`=1
SELECT COUNT(*) FROM `imei` WHERE `sold`=1