frontend/controllers/DetailtransController.php

SELECT * FROM `detail_trans` WHERE (`id_imei`='15') OR (`phone`='081371252919')
---
    public function actionCreate()
    {
        $model = new DetailTrans();
        $session = Yii::$app->session;
        $session->open();
        if ($model->load(Yii::$app->request->post())) {

            $post = Yii::$app->request->post('DetailTrans');
            $phone = $post['phone'];
            $session['name'] = $post['name'];
            $session['email'] = $post['email'];
            $session['address'] = $post['address'];
            $session['phone'] = $post['phone'];
            $with = '08';
            $phone_check = StringHelper::startsWith($phone, $with, $caseSensitive = true);
            if($phone_check == true){
                //Check sudah input imei atau belum!
                if($session['idimei'] == ''){
                    Yii::$app->session->setFlash('flashMessage', 'Anda belum memasukkan imei di halaman sebelumnya!');
                        return $this->render('create', [
                            'model' => $model,
                        ]);
                }else{
                    //Check Imei sudah dipakai atau belum!
                    $imeiattemp = (new \yii\db\Query())
                            ->select(['*'])
                            ->from('detail_trans')
                            ->where(['id_imei' => $session['idimei']])
                            ->orwhere(['phone' => $phone])
                            ->all();