frontend/controllers/ImeicheckController.php

SELECT `id_imei` FROM `imei` WHERE (`imei1`='865249031551713') AND (`sold`=1)
SELECT `id_imei` FROM `imei` WHERE (`imei1`='865249030547597') AND (`warehouse`=1)
---
    public function actionCheck()
    {
        $model = new CheckForm();
        //$modeltrans = new detailtrans();
        $session = Yii::$app->session;
        $session->open();
        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $post = Yii::$app->request->post('CheckForm');
            $imeicheck = $post['imeicheck'];
            $session['imei'] = $imeicheck;
            //var_dump($imeicheck);exit();
            $checking = (new \yii\db\Query())
                        ->select('id_imei')
                        ->from('imei')
                        ->where(['imei1' => $imeicheck])
                        ->andwhere(['sold' => 1])
                        ->all();



            /*$imeiattemp = (new \yii\db\Query())
                            ->select(['*'])
                            ->from('detail_trans')
                            ->where(['id_imei' => $checking['id_imei']])
                            ->all();*/

            $checkware = (new\yii\db\Query())
                        ->select(['id_imei'])
                        ->from('imei')
                        ->where(['imei1' => $imeicheck])
                        ->andwhere(['warehouse' => 1])
                        ->all();